In [2]:
import pandas as pd
import numpy as np

In [4]:
Location = "Kickstartercombo.csv"
df = pd.read_csv(Location)

df.head()

,Unnamed: 0,ID,name,main_category,category,country,state,goal,pledged,currency,launched,deadline,backers,usd pledged,usd_goal_real,usd_pledged_real
0,0,1000002330,The Songs of Adelaide & Abullah,Publishing,Poetry,GB,failed,1000.0,0.0,GBP,2015-08-11 12:12:00,2015-10-09 11:36:00,0,0.0,NaN,NaN
1,1,1000004038,Where is Hank?,Film & Video,Narrative Film,US,failed,45000.0,220.0,USD,2013-01-12 00:20:00,2013-02-26 00:20:00,3,220.0,NaN,NaN
2,2,1000007540,ToshiCapital Rekordz Needs Help to Complete Album,Music,Music,US,failed,5000.0,1.0,USD,2012-03-17 03:24:00,2012-04-16 04:24:00,1,1.0,NaN,NaN
3,3,1000011046,Community Film Project: The Art of Neighborhoo...,Film & Video,Film & Video,US,canceled,19500.0,1283.0,USD,2015-07-04 08:35:00,2015-08-29 01:00:00,14,1283.0,NaN,NaN
4,4,1000014025,Monarch Espresso Bar,Food,Restaurants,US,successful,50000.0,52375.0,USD,2016-02-26 13:38:00,2016-04-01 13:38:00,224,52375.0,NaN,NaN

In [9]:
df.columns

Index(['Unnamed: 0', 'ID', 'name', 'main_category', 'category', 'country',
       'state', 'goal', 'pledged', 'currency', 'launched', 'deadline',
       'backers', 'usd pledged', 'usd_goal_real', 'usd_pledged_real'],
      dtype='object')

In [10]:
df2 = df[['main_category','category','country','state','country','pledged']]

In [11]:
df2.head()

  main_category        category country       state country  pledged
0    Publishing          Poetry      GB      failed      GB      0.0
1  Film & Video  Narrative Film      US      failed      US    220.0
2         Music           Music      US      failed      US      1.0
3  Film & Video    Film & Video      US    canceled      US   1283.0
4          Food     Restaurants      US  successful      US  52375.0

In [19]:
df3 = df2[df2['main_category']==('Technology')]

In [35]:
df3.head()

         category country country       state country country  pledged
0          Poetry      GB      GB      failed      GB      GB      0.0
1  Narrative Film      US      US      failed      US      US    220.0
2           Music      US      US      failed      US      US      1.0
3    Film & Video      US      US    canceled      US      US   1283.0
4     Restaurants      US      US  successful      US      US  52375.0

In [20]:
df3['category'].value_counts()

Technology           12704
Apps                 11212
Web                   7107
Hardware              6827
Software              5609
Gadgets               5140
Wearables             2136
DIY Electronics       1601
3D Printing           1240
Sound                 1156
Robots                1027
Flight                 787
Camera Equipment       723
Space Exploration      585
Fabrication Tools      445
Makerspaces            431
Name: category, dtype: int64

In [21]:
df3.head()

   main_category  category country     state country  pledged
57    Technology  Hardware      CA    failed      CA      0.0
61    Technology   Gadgets      US  canceled      US   2030.0
62    Technology       Web      US    failed      US    141.0
88    Technology   Gadgets      CA    failed      CA      3.0
94    Technology      Apps      CA  canceled      CA  11336.0

In [45]:
df4 = df3[['category','country','state','country','pledged']]

In [51]:
df4 = head()

NameError: name 'head' is not defined

In [47]:
df4['category'].value_counts()

Series([], Name: category, dtype: int64)

In [48]:
df4.head()

Empty DataFrame
Columns: [category, country, country, state, country, country, pledged]
Index: []

Empty DataFrame
Columns: [category, country, country, state, country, country, pledged]
Index: []